// При виклику функції test() буде виведено локальну змінну a зі значенням 2, а не глобальну змінну a зі значенням 1, оскільки функція має доступ до своєї власної локальної області видимості.
let a = 1; // глобальна змінна

function test() {
let a = 2; // локальна змінна
console.log(a); // виводимо локальну змінну, a = 2
}

test(); // викликаємо функцію, виведе 2
console.log(a); // виводимо глобальну змінну, a = 1



// Якщо змінна lang має значення 'ua', то виведеться "Січень". Якщо значення 'en', то виведеться "January". Якщо значення 'fr', то виведеться "Janvier". Якщо значення не входить в задані варіанти, то виведеться "Невідомо".
let lang = prompt("Введіть мову");
let month = '';
switch(lang) {
case 'ua':
month = 'Січень';
break;
case 'en':
month = 'January';
break;
case 'fr':
month = 'Janvier';
break;
default:
month = 'Невідомо';
break;
}
console.log(month);



// Якщо користувач введе "Кава", то в консоль виведеться "Вартість вашого напою: 25 грн". Якщо користувач введе "Чай", то в консоль виведеться "Вартість вашого напою: 15 грн". Якщо користувач введе "Сік", то в консоль виведеться "Вартість вашого напою:

let drink = prompt("Який напій ви бажаєте купити? (Кава, Чай, Сік)");
let price = 0;
switch(drink) {
case 'Кава':
price = 25;
break;
case 'Чай':
price = 15;
break;
case 'Сік':
price = 30;
break;
default:
console.log("Такого напою немає у меню");
break;
}
if(price > 0) {
console.log(`Вартість вашого напою: ${price} грн`);
}

